# Decision Tree

In [1]:
import pandas as pd

df = pd.read_csv('salaries.csv')

In [6]:
inputs = df.drop('salary_more_then_100k', axis = 'columns')
target = df['salary_more_then_100k']

In [7]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [12]:
# Encoding string_character to numeric labels with LabelEncoder
from sklearn.preprocessing import LabelEncoder 
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [13]:
# Creating new columns for the label values
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

In [14]:
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [18]:
# Dropping the string_chars for company, job and degree column
inputs_n = inputs.drop(['company', 'job', 'degree'], axis = 'columns')

In [19]:
# Working with the Decision Tree
from sklearn.tree import DecisionTreeClassifier
model = DecisionTreeClassifier()
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [20]:
model.score(inputs_n, target)

1.0

## Exercise

In [54]:
pd.options.mode.chained_assignment = None  # default='warn'
new_df = pd.read_csv('Exercise/titanic.csv')
new_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [55]:
pd.options.mode.chained_assignment = None  # default='warn'
new_df.dropna(axis = 0, inplace = True)
output = new_df.Survived
new_inputs = new_df[['Pclass', 'Sex', 'Age', 'Fare']]

In [56]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()
new_inputs['Sex_n'] = le_sex.fit_transform(new_df['Sex'])

In [57]:
new_inputs.drop(['Sex'], axis = 'columns', inplace = True)

In [58]:
new_inputs.head()

    Pclass   Age     Fare  Sex_n
1        1  38.0  71.2833      0
3        1  35.0  53.1000      0
6        1  54.0  51.8625      1
10       3   4.0  16.7000      0
11       1  58.0  26.5500      0

In [62]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(new_inputs, output, test_size = 0.1)

In [65]:
tree_model = DecisionTreeClassifier().fit(X_train, y_train)

In [67]:
tree_model.score(X_train, y_train)

1.0

In [68]:
tree_model.score(X_test, y_test)

0.7368421052631579